W6D5/99_cats/cats/app/controllers/cats_controller.rb

    def show
        @cat = Cat.find(params["id"])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        cat = Cat.find_by(id: params[:id])
        if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "this is a new text"], ["updated_at", "2020-10-09 20:22:52.401427"], ["id", 4]]